Revit 2027 API
Settings.Categories Property
Retrieves an object that provides access to all the categories contained in the Autodesk Revit application and project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Categories Categories { get; }
Public ReadOnly Property Categories As Categories
	Get
public:
property Categories^ Categories {
	Categories^ get ();
}
member Categories : Categories with get
Property Value
Categories
See Also
Reference
Settings Class
Autodesk.Revit.DB Namespace